Tekla.Structures.ModelInternal.IPrintingController
Interface for the PrintingController.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.ModelInternal.IPrintingController.PrintReportToPdf(Tekla.Structures.ModelInternal.PrintingController.PrintReportToPdfArgs)
Print report to PDF.
arguments: The print report to pdf arguments.
Returns: The print report to pdf results.